{
  "_name_or_path": "beomi/kcbert-base",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "directionality": "bidi",
  "finetuning_task": "pvot",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "elevator-call",
    "1": "gas-off",
    "10": "heat-reservation-off-after",
    "11": "heat-reservation-off-at",
    "12": "heat-reservation-on-after",
    "13": "heat-reservation-on-at",
    "14": "heat-reservation-state",
    "15": "heat-state",
    "16": "heat-up",
    "17": "light-off",
    "18": "light-on",
    "19": "parking-location",
    "2": "gas-on",
    "20": "search",
    "21": "security-off",
    "22": "security-on",
    "23": "vent-down",
    "24": "vent-off",
    "25": "vent-on-high",
    "26": "vent-on-low",
    "27": "vent-on-mid",
    "28": "vent-state",
    "29": "vent-up",
    "3": "greeting_chat",
    "30": "weather",
    "4": "heat-cold-state",
    "5": "heat-down",
    "6": "heat-hot-state",
    "7": "heat-off",
    "8": "heat-on",
    "9": "heat-reservation-cancel"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "elevator-call": 0,
    "gas-off": 1,
    "gas-on": 2,
    "greeting_chat": 3,
    "heat-cold-state": 4,
    "heat-down": 5,
    "heat-hot-state": 6,
    "heat-off": 7,
    "heat-on": 8,
    "heat-reservation-cancel": 9,
    "heat-reservation-off-after": 10,
    "heat-reservation-off-at": 11,
    "heat-reservation-on-after": 12,
    "heat-reservation-on-at": 13,
    "heat-reservation-state": 14,
    "heat-state": 15,
    "heat-up": 16,
    "light-off": 17,
    "light-on": 18,
    "parking-location": 19,
    "search": 20,
    "security-off": 21,
    "security-on": 22,
    "vent-down": 23,
    "vent-off": 24,
    "vent-on-high": 25,
    "vent-on-low": 26,
    "vent-on-mid": 27,
    "vent-state": 28,
    "vent-up": 29,
    "weather": 30
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 300,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.2.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30000
}
